// knapsack_constants.js

/**
 * Исходные данные задачи о ранце (Knapsack Problem).
 * m = [1, 2, 3, 4, 5, 6, 7]
 * w = [2, 3, 5, 7, 1, 4, 1] (вес, weight)
 * p = [10, 5, 15, 7, 6, 18, 3] (ценность, price)
 */
export const ITEMS = [
  { id: 1, w: 2, p: 10 },
  { id: 2, w: 3, p: 5 },
  { id: 3, w: 5, p: 15 },
  { id: 4, w: 7, p: 7 },
  { id: 5, w: 1, p: 6 },
  { id: 6, w: 4, p: 18 },
  { id: 7, w: 1, p: 3 },
  //   допки
  // { id: 8, w: 2, p: 7 },
  // { id: 9, w: 4, p: 11 },
  // { id: 10, w: 3, p: 10 },
  // { id: 11, w: 8, p: 19 },
  // { id: 12, w: 2, p: 2 },
  // { id: 13, w: 5, p: 6 },
  // { id: 14, w: 8, p: 16 },
  // { id: 15, w: 6, p: 14 },
  // { id: 16, w: 3, p: 9 },
  // { id: 17, w: 2, p: 6 },
  // { id: 18, w: 9, p: 20 },
];

/**
 * Ограничение по весу ранца (W=15).
 */
export const W_MAX = 15; // Аналог W в формуле

/**
 * Параметры алгоритма Имитации Отжига (SA Parameters).
 */

// 1. Начальная температура (T_0)
export const T_START = 200; // Аналог T_0

// 2. Коэффициент охлаждения (alpha)
// В формуле: T_{k+1} = alpha * T_k
export const ALPHA = 0.85; // Аналог alpha

// 3. Минимальная температура (T_min)
// Условие остановки алгоритма.
export const T_MIN = 5; // Аналог T_min

// 4. Количество итераций при фиксированной температуре (L)
// Сколько раз максимально будет сгенерировано соседнее решение при текущей T.
export const L_K = 10; // Аналог L_k
